[{"ownerPic":"images/profile3.jpg","category":"Biology","question":"this is the second test","description":"what do I test?","date":"2015-11-26T11:26:38.387Z"},{"ownerPic":"images/profile3.jpg","category":"Biology","question":"this is test for mongodb","description":"checking the description","date":"2015-11-26T11:10:22.490Z"},{"ownerPic":"images/profile3.jpg","category":"Biology","question":"this is a test with date","description":"the test will work?","date":"2015-11-23T17:21:41.673Z"},{"query_id":"1","ownerPic":"images/profile3.jpg","category":"Biology","question":"how do i connect a wifi card into a pc?","description":"I bought a new wireless network card for my PC and I know that I have a PCI-Express port in my motherboard but I have no idea how to connect it properly","comments":[{"author":"david beckham","ownerPic":"images/profile3.jpg","text":"It's an interesting approach. But, I think it may be come too complex when the HTML for the modals starts to get larger, unless I am misunderstanding what you are suggesting.","date":"2012-04-23T18:25:43.511Z"},{"author":"nelly kapela","ownerPic":"images/profile2.jpg","text":"I think jQuery UI and Bootstrap do something a bit similar to what you are saying. I think they inject, at the very least, the element for the modal window into the body element and then just re-use that for each modal that needs to be opened. I am also using a backdrop, but in my case, the modals container is the backdrop.","date":"2012-04-23T18:25:43.511Z"}]},{"query_id":"2","ownerPic":"images/profile3.jpg","category":"Biology","question":"if heat","description":"dfdfdf"},{"query_id":"3","ownerPic":"images/profile3.jpg","category":"Biology","question":"what is kiara?"},{"query_id":"4","ownerPic":"images/profile3.jpg","category":"Biology","question":"1+1=?","description":"is it 3?"},{"query_id":"5","ownerPic":"images/profile3.jpg","category":"Biology","question":"Index of refraction for travelling EM wave problem","description":"Since everything around us isn't absolute zero temperature, and it has heat/energy, then we should be able to use that energy (without temp' difference I mean) and by using that energy (for example converting it to electricity) cooling the area from which we took the heat from. So is there a way to convert heat without temp difference? Thanks in advance :)"},{"query_id":"6","ownerPic":"images/profile3.jpg","category":"Biology","question":"If heat is energy, then why does cooling take energy when it should actually give energy?","description":"Since everything around us isn't absolute zero temperature, and it has heat/energy, then we should be able to use that energy (without temp' difference I mean) and by using that energy (for example converting it to electricity) cooling the area from which we took the heat from. So is there a way to convert heat without temp difference? Thanks in advance :)"},{"query_id":"7","ownerPic":"images/profile3.jpg","category":"Biology","question":"Reduced density operator of a maximally entangled state","description":"Is the reduced density operator of a maximally entangled pure state always maximally mixed (trace being half)? I test it on 4 bell state and this claim is true. I wonder why and can the degree of enta"},{"query_id":"8","ownerPic":"images/profile3.jpg","category":"Biology","question":"What are the evolutionary benefits of mating for life, as opposed to serial monogamy?","description":"I have a sapient (alien) species that behaves more or less similarly to humans, and that includes their romantic interactions. However, although they court/date each other much like we do, there is a certain mechanic that shapes their cultural understanding of romance. If a courting pair of these creatures lock gazes and share a warm fuzzy \"love struck\" moment, as we might describe it, their pheromone production spikes, and the ensuing surge of endorphins is so strong that it rewires their brains permanently, devoting the two individuals to each other for the rest of their lives. Pairs who have had this bonding moment have zero interest in infidelity and simply can't fathom getting a divorce, no matter how much they might argue. Non-bonded pairs exist too, but they are much rarer than bonded pairs and are generally either judged or pitied by the rest of society.","date":"2012-04-23T18:25:43.511Z"},{"query_id":"9","ownerPic":"images/profile1.jpg","category":"Physics","question":"What does an undefined formula in physics mean?","description":"I am trying to figure out how undefined formulas in mathematics relates to physics. Take the following formula for terminal velocity.","date":"2012-04-23T18:25:43.511Z"},{"query_id":"10","ownerPic":"images/profile2.jpg","category":"Math","question":"The Erasmus pentagon","description":"Professor Erasmus has constructed a special convex pentagon ABCDE that he modestly calls the ","date":"2012-04-23T18:25:43.511Z"},{"query_id":"11","ownerPic":"images/profile1.jpg","category":"Bussiness","question":"My boss is leaving the company. Should I tell senior management?","description":"My Boss is leaving our company, and already has new job lined up (with start Date, 60 days from now). He is holding off on telling the company. The problem is that he now has a F*** It attitude and I am having to do a lot of his work. I am possibly up for his seat when he leaves. We are a corp. structured company. Should I tell someone higher up about this information? And will that hurt or help my chances at promotion?","date":"2012-04-23T18:25:43.511Z"}]